# Реализуйте алгоритм перемешивания списка.

import random

def arr_():
    for i in range(count):
        lst_.append(i)
    print(lst_)

def reversed2(lst_):
    res = sorted(lst_, key=lambda count: random.random())
    print(res)

count = int(input('Введите количество элеменктов списка: \n'))
lst_ = []
res = []
arr_()
reversed2(lst_)